{
    "apple scab":{
        "description": "apple scab, disease of apple trees caused by the ascomycete fungus Venturia inaequalis. Apple scab is found wherever apples and crabapples are grown but is most severe where spring and summer are cool and moist. The disease can cause high crop losses and is thus of economic import to apple growers.",
        "cure": " Regular spraying with fungicides is the most effective method of controlling the disease.",
        "links": ["https://www.amazon.in/s?k=funcidies&crid=B3CWMRQC1OEE&sprefix=funcidie%2Caps%2C193&ref=nb_sb_noss",
                  "https://www.bighaat.com/search/fungicides"]
    },
    "apple black rot":{
        "description": "Black rot is caused by the fungus Diplodia seriata (syn Botryosphaeria obtusa). The fungus can infect dead tissue as well as living trunks, branches, leaves and fruits.",

        "cure": "Prune out dead or diseased branches. Pick all dried and shriveled fruits remaining on the trees. Remove infected plant material from the area.",
        "links": ["https://www.amazon.in/s?k=funcidies&crid=B3CWMRQC1OEE&sprefix=funcidie%2Caps%2C193&ref=nb_sb_noss",
        "https://www.bighaat.com/search/fungicides"]
    },
    "cedar-apple rust":{
        "description": "cedar-apple rust, plant disease that primarily affects eastern red cedar (Juniperus virginiana) and various apple and crabapple species (genus Malus) in North America and that is caused by the fungus Gymnosporangium juniperi-virginianae. ",
        "cure": "The disease can be controlled by eradicating either host in a given area or by timely application of a fungicide, in spring for junipers and in summer for apples.",
        "links": ["https://www.amazon.in/s?k=funcidies&crid=B3CWMRQC1OEE&sprefix=funcidie%2Caps%2C193&ref=nb_sb_noss",
        "https://www.bighaat.com/search/fungicides"]
    },
    "powdery mildrew" : {
        "description": "White to gray powdery spots, blotches or felt-like mats form on leaves, green stems and buds. Infected plants may appear to be sprinkled with baby powder or covered in cobwebs. Young leaves, water sprouts and green shoots are often most severely affected.",
        "cure": "Sulfur dust is effective against many powdery mildews but should not be applied in hot weather. A number of other organic treatments, including copper-based fungicides, baking soda solutions, and neem oil, have also proven effective. Planting resistant varieties, staking plants to improve air circulation, removing diseased plant parts, and sterilizing contaminated gardening shears can prevent or reduce the spread of the disease.",
        "links": ["https://www.amazon.in/s?k=fungicides+copper&crid=ZJDORYU4VE6F&sprefix=fungicide+copper%2Caps%2C223&ref=nb_sb_noss_1",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "cercospora leaf spot":{
        "description": "Cercospora leaf spot, a fungus infection in which the leaves become greenish yellow and root weight and sugar content are reduced, are most serious and can cause great damage if not controlled. ",
        "cure": "Disease management tactics include using resistant corn hybrids, conventional tillage where appropriate, and crop rotation. Foliar fungicides can be effective if economically warranted. ",
        "links": ["https://www.amazon.in/s?k=fungicides+foliar&crid=36H4MW58HMH90&sprefix=fungicides+folia%2Caps%2C190&ref=nb_sb_noss",
                "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "common rust corn":{
        "description": "Common rust produces rust-colored to dark brown, elongated pustules on both leaf surfaces. The pustules contain rust spores (urediniospores) that are cinnamon brown in color. Pustules darken as they age. Leaves, as well as sheaths, can be infected. The pathogen is a rust fungus called Puccinia sorghi.",
        "cure": "Disease management tactics include using resistant corn hybrids, conventional tillage where appropriate, and crop rotation. Foliar fungicides can be effective if economically warranted. ",
        "links":["https://www.amazon.in/s?k=fungicides+foliar&crid=36H4MW58HMH90&sprefix=fungicides+folia%2Caps%2C190&ref=nb_sb_noss",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "northern leaf blight":{
        "description": "Typical symptoms of northern corn leaf blight are canoe-shaped lesions 1 inch to 6 inches long. The lesions are initially bordered by gray-green margins. They eventually turn tan colored and may contain dark areas of fungal sporulation. The length or size of lesions may vary with in different corn hybrids reactions with different resistance genes. Lesions begin on the lower leaves and then spread to upper leaves. Severe symptoms can progress rapidly, resulting in blighted leaves.",
        "cure": "Use resistant hybrids. Fungicides may be warranted on inbreds for seed production during the early stages of this disease. Crop rotation and tillage practices may be helpful in some cases.",
        "links":["https://www.amazon.in/s?k=fungicides+foliar&crid=36H4MW58HMH90&sprefix=fungicides+folia%2Caps%2C190&ref=nb_sb_noss",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "black rot grape":{
        "description": "Grape black rot is a fungal disease caused by an ascomycetous fungus, Guignardia bidwellii, that attacks grape vines during hot and humid weather. “Grape black rot originated in eastern North America, but now occurs in portions of Europe, South America, and Asia. It can cause complete crop loss in warm, humid climates, but is virtually unknown in regions with arid summers.",
        "cure": "Infected prunings and mummified berries should be removed, burned, and/or buried in the soil before new growth begins in the spring. In vineyards with susceptible varieties or where black rot was a problem the previous year, early season fungicide sprays (sulphur and copper) should be timed to prevent the earliest infections.",
        "links":["https://www.amazon.in/s?k=fungicides+sulpher&crid=18AZ3PVNB7O1I&sprefix=fungicides+sulphe%2Caps%2C182&ref=nb_sb_noss",
        "https://www.bighaat.com/search/supher%20fungicides"]
    },
    "esca grape":{
        "description": "One of the common fungal diseases is Esca (Black Measles) which is found in the Grape Plants and can be easily identified as brown streaking lesions on any part of the leaf. The affected leaves can dry off completely and fall off from the plant prematurely which eventually results in death of the plant.",
        "cure": "Prune affected areas, use fungicides, improve airflow, plant resistant varieties, and monitor regularly.",
        "links": ["https://www.amazon.in/s?k=funcidies&crid=B3CWMRQC1OEE&sprefix=funcidie%2Caps%2C193&ref=nb_sb_noss",
                  "https://www.bighaat.com/search/fungicides"]
    },
    "isariopsis leaf spot":{
        "description": " Isariopsis leaf spot causes dark, sunken lesions on grape leaves, leading to premature leaf drop.",
        "cure": "Remove infected leaves, use copper-based fungicides, ensure proper vine spacing, and maintain good vineyard hygiene.",
        "links": ["https://www.amazon.in/s?k=fungicides+copper&crid=ZJDORYU4VE6F&sprefix=fungicide+copper%2Caps%2C223&ref=nb_sb_noss_1",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "Haunglongbing orange":{
        "description": "Huanglongbing (HLB) or citrus greening is the most severe citrus disease, currently devastating the citrus industry worldwide. The presumed causal bacterial agent Candidatus Liberibacter spp. affects tree health as well as fruit development, ripening and quality of citrus fruits and juice.",
        "cure": "There is no cure for Huanglongbing (HLB); manage the disease by removing infected trees, using disease-free nursery stock, controlling insect vectors (like the Asian citrus psyllid), and applying recommended treatments to manage symptoms and protect healthy trees.",
        "links": []
    },
    "bacterial spot peach":{
        "description": "Bacterial spot in peaches causes dark, sunken lesions with reddish halos on leaves, fruit, and branches, leading to premature leaf drop and fruit rot.",
        "cure": " Remove and destroy infected plant parts, apply copper-based bactericides, practice good orchard sanitation, and ensure proper spacing for airflow to reduce humidity.",
        "links": ["https://www.amazon.in/s?k=copper+bactericides&crid=3D2OB1YGXFC6E&sprefix=copper+bactericide%2Caps%2C183&ref=nb_sb_noss_2",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "bacterial spot bellpeppers":{
        "description": " Bacterial spot on bell peppers, caused by Xanthomonas campestris, is characterized by dark, sunken lesions with water-soaked halos on leaves, stems, and fruit. This disease leads to premature leaf drop, fruit decay, and significant reductions in yield and quality.",
        "cure": "Manage bacterial spot by promptly removing and destroying infected plants and plant debris to prevent further spread. Apply copper-based bactericides according to label instructions, and implement crop rotation with non-host plants to reduce soil-borne bacteria. Maintain good field sanitation practices, including cleaning tools and avoiding overhead irrigation, to minimize bacterial transmission and maintain overall plant health.",
        "links": ["https://www.amazon.in/s?k=copper+bactericides&crid=3D2OB1YGXFC6E&sprefix=copper+bactericide%2Caps%2C183&ref=nb_sb_noss_2",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "early blight potato":{
        "description": "Early blight in potatoes, caused by Alternaria solani, features dark, concentric-ringed lesions on leaves, stems, and tubers. It leads to premature leaf death, reduced photosynthesis, and decreased tuber yield and quality.",
        "cure": "Manage early blight by rotating crops with non-solanaceous plants, applying fungicides like chlorothalonil or copper-based products, and removing and destroying infected plant debris. Ensure proper spacing and ventilation to reduce humidity and improve air circulation around plants.",
        "links": ["https://www.amazon.in/s?k=chlorothalonil+fungicide&crid=G4KP8K0RXL4H&sprefix=chlorotha%2Caps%2C190&ref=nb_sb_ss_pltr-data-refreshed_1_9,",
            "https://www.bighaat.com/search/chlorothalonil"]
    },
    "late blight potato":{
        "description": " Late blight in potatoes, caused by Phytophthora infestans, results in water-soaked lesions on leaves, stems, and tubers, which can rapidly spread, leading to plant decay and significant yield loss.",
        "cure": "Manage late blight by applying fungicides such as mancozeb or metalaxyl, removing and destroying infected plant material, practicing crop rotation with non-host crops, and ensuring proper field sanitation. Maintain good air circulation and avoid overhead irrigation to reduce humidity and prevent the disease's spread.",
        "links": [
            "https://www.amazon.in/s?k=mancozeb&crid=1DCERR73MGNK8&sprefix=mancozeb+%2Caps%2C243&ref=nb_sb_noss_2",
            "https://www.bighaat.com/search/metaxil"
        ]
    },
    "powdery mildrew squash":{
        "description": "Powdery mildew on squash, caused by Podosphaera xanthii, appears as white, powdery spots on leaves, stems, and fruit. It leads to reduced photosynthesis, leaf drop, and decreased fruit quality and yield.",
        "cure": "Manage powdery mildew by applying fungicides like sulfur or potassium bicarbonate, removing and destroying affected plant parts, and improving air circulation around plants. Ensure proper spacing, avoid overhead watering, and use resistant squash varieties if available.",
        "links": ["https://www.amazon.in/s?k=fungicides+copper&crid=ZJDORYU4VE6F&sprefix=fungicide+copper%2Caps%2C223&ref=nb_sb_noss_1",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "leaf scorch strawberry":{
        "description": "Leaf scorch in strawberries causes brown, crispy leaf edges and lesions, often due to environmental stress, such as excessive heat, drought, or high light intensity. It can lead to reduced plant vigor and fruit production.",
        "cure": "Manage leaf scorch by ensuring consistent soil moisture through regular irrigation, providing shade or protection from intense sunlight, and using mulch to maintain soil humidity. Avoid excessive fertilization and implement proper plant spacing to reduce stress and improve air circulation.",
        "links": []
    },
    "bacterial spot tomato":{
        "description": "Bacterial spot in tomatoes, caused by Xanthomonas perforans, results in dark, water-soaked lesions with concentric rings on leaves, stems, and fruit. This disease leads to reduced yield and fruit quality due to premature leaf drop and fruit decay.",
        "cure": "Manage bacterial spot by removing and destroying infected plant material, applying copper-based bactericides, and practicing crop rotation with non-solanaceous plants. Ensure proper field sanitation, avoid overhead irrigation, and maintain good air circulation to minimize disease spread.",
        "links": ["https://www.amazon.in/s?k=copper+bactericides&crid=3D2OB1YGXFC6E&sprefix=copper+bactericide%2Caps%2C183&ref=nb_sb_noss_2",
        "https://www.bighaat.com/search/copper%20fungicides"]
    },
    "early blight tomato":{
        "description": " Early blight in tomatoes, caused by Alternaria solani, manifests as dark, concentric-ringed lesions on older leaves, stems, and fruit. It leads to premature leaf drop, reduced photosynthesis, and lower yields.",
        "cure": "Manage early blight by applying fungicides like chlorothalonil or copper-based products, removing and destroying infected plant debris, and practicing crop rotation with non-host crops. Improve air circulation and avoid overhead irrigation to reduce humidity and prevent disease spread.",
        "links": ["https://www.amazon.in/s?k=chlorothalonil+fungicide&crid=G4KP8K0RXL4H&sprefix=chlorotha%2Caps%2C190&ref=nb_sb_ss_pltr-data-refreshed_1_9,",
            "https://www.bighaat.com/search/chlorothalonil"]
    },
    "late blight tomato":{
        "description": "Late blight in tomatoes, caused by Phytophthora infestans, is characterized by water-soaked lesions with a greenish-brown border on leaves, stems, and fruit, leading to rapid plant decay and severe yield loss.",
        "cure": "Manage late blight by applying fungicides such as mancozeb or metalaxyl, removing and destroying infected plant material, practicing crop rotation with non-solanaceous crops, and ensuring proper field sanitation. Improve air circulation and avoid overhead irrigation to reduce humidity and slow disease spread.",
        "links": [
            "https://www.amazon.in/s?k=mancozeb&crid=1DCERR73MGNK8&sprefix=mancozeb+%2Caps%2C243&ref=nb_sb_noss_2",
            "https://www.bighaat.com/search/metaxil"
        ]
    },
    "leaf mold tomato":{
        "description": "Leaf mold in tomatoes, caused by Cladosporium fulvum, leads to dark, fuzzy mold on the undersides of leaves, resulting in yellowing and leaf drop. It can reduce plant vigor and fruit yield.",
        "cure": "Manage leaf mold by removing and destroying affected leaves, applying fungicides like chlorothalonil or copper-based products, and improving air circulation around plants. Ensure proper spacing, avoid overhead watering, and use resistant tomato varieties if available.",
        "links": ["https://www.amazon.in/s?k=chlorothalonil+fungicide&crid=G4KP8K0RXL4H&sprefix=chlorotha%2Caps%2C190&ref=nb_sb_ss_pltr-data-refreshed_1_9,",
            "https://www.bighaat.com/search/chlorothalonil"]
    },
    "septoria leaf spot tomato":{
        "description": "Septoria leaf spot in tomatoes, caused by Septoria lycopersici, features small, circular lesions with dark centers and yellow halos on leaves. This disease leads to premature leaf drop and reduced plant vigor and yield.",
        "cure": "Manage Septoria leaf spot by removing and destroying infected leaves and debris, applying fungicides such as chlorothalonil or copper-based products, and practicing crop rotation with non-solanaceous crops. Ensure proper plant spacing, improve air circulation, and avoid overhead irrigation to reduce humidity and disease spread.",
        "links": ["https://www.amazon.in/s?k=chlorothalonil+fungicide&crid=G4KP8K0RXL4H&sprefix=chlorotha%2Caps%2C190&ref=nb_sb_ss_pltr-data-refreshed_1_9,",
            "https://www.bighaat.com/search/chlorothalonil"]
    },
    "two spotted spidermite tomato":{
        "description": "The two-spotted spider mite (Tetranychus urticae) infests tomatoes, causing stippling, yellowing, and webbing on leaves. Heavy infestations can lead to reduced plant vigor and yield.",
        "cure": "Manage spider mites by using miticides or insecticidal soaps, removing heavily infested plant parts, and introducing natural predators like predatory mites or ladybugs. Maintain good plant hygiene, ensure proper watering to reduce plant stress, and increase humidity around plants to make conditions less favorable for mite development.",
        "links":[
            "https://www.amazon.in/s?k=miticides&crid=3KCCRGDWCLWN&sprefix=miticide%2Caps%2C190&ref=nb_sb_noss_1",
            "https://www.amazon.in/s?k=insecticidal+soaps&crid=NAAG0ZFP6XKE&sprefix=insecticidal+soaps%2Caps%2C187&ref=nb_sb_noss_2",
            "https://www.bighaat.com/search/miticides"
        ]
    },
    "target spot tomato":{
        "description": "Target spot in tomatoes, caused by Corynespora cassiicola, appears as small, round lesions with concentric rings and a dark center on leaves, stems, and fruit. It can lead to reduced photosynthesis, premature leaf drop, and decreased yield.",
        "cure": "Manage target spot by removing and destroying infected plant material, applying fungicides like chlorothalonil or azoxystrobin, and practicing crop rotation with non-solanaceous crops. Improve air circulation, avoid overhead irrigation, and use resistant tomato varieties if available.",
        "links": [
            "https://www.amazon.in/s?k=azoxystrobin&crid=3OJGPHZZC7H57&sprefix=azoxystrobin%2Caps%2C182&ref=nb_sb_noss_1",
            "https://www.amazon.in/s?k=chlorothalonil+fungicide&crid=G4KP8K0RXL4H&sprefix=chlorotha%2Caps%2C190&ref=nb_sb_ss_pltr-data-refreshed_1_9,",
            "https://www.bighaat.com/search/chlorothalonil"

        ]
    },
    "yellow leaf curl virus tomato":{
        "description": "Tomato Yellow Leaf Curl Virus (TYLCV) causes yellowing and curling of tomato leaves, stunted growth, and reduced fruit yield. The virus is transmitted by whiteflies and can lead to severe plant damage.",
        "cure": "Manage TYLCV by controlling whitefly populations with insecticides or biological controls, removing and destroying infected plants, and using virus-resistant tomato varieties. Maintain good field sanitation, avoid planting susceptible varieties, and implement whitefly management practices to reduce virus spread.",
        "links": [
            "https://www.amazon.in/s?k=wheatfly+insecticide&crid=ZOP0442D1IKD&sprefix=wheatfly+insecticid%2Caps%2C178&ref=nb_sb_noss",
            "https://www.bighaat.com/search/whitefly%20insecticide"
        ]
    },
    "mosaic virus tomato":{
        "description": "Tomato mosaic virus (ToMV) causes mottled, mosaic-like patterns on leaves, distorted fruit, and stunted plant growth. It reduces yield and affects the quality of tomatoes.",
        "cure": " Manage Tomato mosaic virus by removing and destroying infected plants, using resistant tomato varieties, and practicing crop rotation. Ensure good field sanitation, avoid handling plants when wet to prevent spreading, and clean tools and equipment to reduce virus transmission.",
        "links": []
    },
    "Potato Early Blight":{
        "description": " Early blight in potatoes, caused by Alternaria solani, is characterized by dark, concentric-ringed lesions on leaves, stems, and tubers. It leads to premature leaf death, reduced photosynthesis, and lower yields.",
        "cure": " Manage early blight by applying fungicides like chlorothalonil or copper-based products, removing and destroying infected plant debris, and practicing crop rotation with non-solanaceous plants. Improve air circulation around plants and avoid overhead irrigation to minimize humidity and prevent the spread of the disease.",
        "links": ["https://www.amazon.in/s?k=chlorothalonil+fungicide&crid=G4KP8K0RXL4H&sprefix=chlorotha%2Caps%2C190&ref=nb_sb_ss_pltr-data-refreshed_1_9,",
            "https://www.bighaat.com/search/chlorothalonil"]
    },
    "Potato Late Blight":{
        "description": " Late blight in potatoes, caused by Phytophthora infestans, leads to water-soaked lesions on leaves, stems, and tubers, often accompanied by a white, fuzzy growth on the underside of leaves. The disease can cause rapid plant decay and severe yield loss.",
        "cure": "Manage late blight by applying fungicides such as mancozeb or metalaxyl, removing and destroying infected plant material, and practicing crop rotation with non-solanaceous crops. Improve air circulation around plants, avoid overhead irrigation, and maintain good field sanitation to reduce humidity and slow the spread of the disease.",
        "links": [
            "https://www.amazon.in/s?k=mancozeb&crid=1DCERR73MGNK8&sprefix=mancozeb+%2Caps%2C243&ref=nb_sb_noss_2",
            "https://www.bighaat.com/search/metaxil"
        ]
    },
    "Sugarcane Mosaic":{
        "description": "Sugarcane mosaic virus causes irregular, mosaic-like patterns on sugarcane leaves, with yellow and green streaks. It can lead to reduced growth, lower yields, and stunted cane development.",
        "cure": "Manage sugarcane mosaic by using resistant varieties, removing and destroying infected plants, and practicing proper field sanitation. Implement insect control measures to manage aphid vectors and avoid planting in fields with a history of the virus.",
        "links": []
    },
    "Sugarcane RedRot":{
        "description": "Red rot in sugarcane, caused by Colletotrichum falcatum, leads to reddish-brown, sunken lesions on the cane, which may turn into a reddish or orange rot. It results in reduced juice quality, lower yields, and can cause significant damage to the cane.",
        "cure": "Manage red rot by using resistant sugarcane varieties, removing and destroying infected cane, and practicing crop rotation. Ensure good field sanitation, avoid excessive moisture, and improve drainage to reduce disease incidence. Applying fungicides can also help control the spread.",
        "links": ["https://www.amazon.in/s?k=funcidies&crid=B3CWMRQC1OEE&sprefix=funcidie%2Caps%2C193&ref=nb_sb_noss",
                  "https://www.bighaat.com/search/fungicides"]
    },
    "Sugarcane Rust":{
        "description": " Rust in sugarcane, caused by Puccinia melanocephala, manifests as reddish-brown pustules on leaves and stems, which can lead to reduced photosynthesis, lower sugar content, and diminished yields.",
        "cure": "Manage rust by using resistant sugarcane varieties, applying fungicides like tebuconazole or propiconazole, and practicing crop rotation. Ensure good field sanitation by removing infected plant debris and improving air circulation to reduce humidity and prevent the spread of the disease.",
        "links": [
            "https://www.amazon.in/s?k=tebuconazole&crid=V03DDVEMO5FW&sprefix=tebuconazole%2Caps%2C195&ref=nb_sb_noss_1",
            "https://www.bighaat.com/search/tebucuanozol",
            "https://www.bighaat.com/search/propiconazole"
        ]
    },
    "Sugarcane Yellow":{
        "description": "Sugarcane yellow disease, often caused by the sugarcane yellow leaf virus (ScYLV) or other viral pathogens, results in yellowing of leaves, stunted growth, and reduced cane yield and quality.",
        "cure": "Manage sugarcane yellow disease by using resistant varieties, removing and destroying infected plants, and practicing good field sanitation. Implement vector control measures to manage insects that transmit the virus, and avoid planting in fields with a history of the disease.",
        "links": []
    }
}